README.org
#+title: README
#+OPTIONS: ^:nil
# #+OPTIONS: *:nil
#+OPTIONS: \n:t
#+SETUPFILE: ~/org/conf/setup/theme-readtheorg.setup


* Configuração
  1. No terminal, navemagos para a pasta onde queremos guardar nosso código

  2. Em seguida, executamos
     : git clone https://github.com/NasreddinHodja/desafio_trab.git

  3. O código faz uso do módulo pandas do python, que deve ser instalado com
     : pip install pandas

  4. O código está contido no arquivo =etl.py= que ser permitido para executar. Para isso, fazemos
     : chmod +x etl.py

  5. Finalmente, para executar o arquivo, fazemos
     : ./etl.py
  
* IN
  * ~deals.contactId -> contacts~
  * ~deals.companyId -> companies~
  * ~companies.sectorId -> sectors~

* OUT
** Gráficos
   Primeiro output deve servir de base para dois gráficos: núm de vendar por contato e valor total vendido por mes.
** Lista de setores
   Segundo output deve ser uma lista de setores de empresa, ordenado por quanto esse setor representa no total vendido pela empresa no mês.
   
